package main

var (
	greeting     = "سلام، به بات تله‌های زندگی خوش آمدی. توصیه می‌کنم قبل از اینکه تست بدی اول راهنما رو بخونی تا دستت بیاد تله‌های زندگی چیه و این تست چطور کار می‌کنه."
	wrongCommand = "دستوری که وارد کردی درست نیست."
	guide        = `تله زندگی (lifetrap) یه الگوی منفی زندگیه که وقتی بچه یا نوجوان بودیم شروع شده، در طول زندگیمون خودش رو تکرار می‌کنه و تغییر دادنش کار سختیه.
	این تست اینطوری کار می‌کنه که تعدادی سوال در مورد وضعیت بچگیت و الانت ازت می‌پرسه و نسبت به جواب‌هایی که دادی بهت می‌گه چه تله‌هایی تو زندگیت داری.`
	menu             = "می‌خوای تست بدی یا تست دادی و می‌خوای تله‌های زندگیت رو ببینی؟"
	testEnded        = "تست تمام شد و این‌ها تله‌های زندگیته:\n"
	showingLifetraps = "این‌ها تله‌های زندگیته:\n"
	testNotCompleted = "هنوز تست رو کامل نکردی."
	noLifetrap       = "مثل اینکه هیچ تله‌ای تو زندگیت نداری، یا خیلی از نظر روانی سالمی یا خب تست رو الکی زدی."
)
